{
  "en": {
    "title": "Alejandro Blanco - QA Automation Engineer",
    "name": "Alejandro Blanco",
    "role": "QA Automation Engineer",
    "email_label": "EMAIL",
    "email": "alejandroblancosanchez0@gmail.com",
    "phone_label": "PHONE",
    "phone": "+57 314 2631327",
    "location_label": "LOCATION",
    "location": "Colombia, Bogota",
    "nav_about": "About",
    "nav_resume": "Resume",
    "nav_portfolio": "Portfolio",
    "about_title": "About Me",
    "about_paragraph_1": "QA Automation Engineer with 5+ years of experience improving software quality and performance across web, mobile, and dataphone environments. I specialize in building scalable frameworks using Java, Serenity BDD, Screenplay, Rest-Assured, and K6.",
    "about_paragraph_2": "Certified in AWS Cloud Practitioner, I've led and contributed to key initiatives such as the correspondent banking project with one of the largest financial groups in Latin America, ensuring test automation and traceability at scale. My work spans CI/CD integration, BDD adoption and performance testing.",
    "about_paragraph_3": "I'm results-driven, self-critical, and focused on delivering clarity through automation. I thrive in agile teams, document precisely, and question assumptions to catch issues early. If you're looking for someone who automates with purpose and thinks in systems: let's talk.",
    "focus_title": "My focus",
    "focus_mobile": "Mobile Automation",
    "focus_mobile_desc": "End-to-end automation on Android using Appium. Different validations designed for both real devices and dataphones.",
    "focus_web": "Web Automation",
    "focus_web_desc": "UI automation with Java, Selenium, and Serenity BDD. Screenplay pattern for maintainability, reusable steps, and Gherkin integration.",
    "focus_api": "API Automation",
    "focus_api_desc": "Validation using Rest-Assured. Dynamic data models, validating endpoints with custom payloads and reusable objects.",
    "focus_k6": "K6 Performance Testing",
    "focus_k6_desc": "Load testing with K6 using Grafana and database validation to measure latency, TPS, error rates, and verify the NRFs.",
    "resume_title": "Resume",
    "experience_section": "EXPERIENCE",
    "education_section": "EDUCATION",
    "role_wompi": "QA Developer",
    "role_assertsoft": "QA Analyst and Tester",
    "role_serviex": "QA Analyst",
    "role_hitss": "QA intern",
    "education_1": "Systems Engineering",
    "education_2": "Technology in Systems Analysis and Design",
    "education_3": "Technician in DB Operation and Maintenance",
    "status_completed": "Completed",
    "portfolio_title": "Portfolio Web",
    "project_1_desc": "A project I made to help improve my English and development skills using Firebase, JavaScript, and CSS. But most importantly, it helped me explore how to work with the ChatGPT API by generating any question using the exact prompt needed.",
    "project_2_desc": "A project I made to help others learn about QA Automation. It includes a variety of resources, tutorials, and guides on topics like Selenium, Rest-Assured, Performance testing and ISTQB Resources. The goal is to provide a comprehensive learning platform for aspiring QA professionals.",
    "status_finalized": "Finalized"
  },
  "es": {
    "title": "Alejandro Blanco - Ingeniero de Automatización QA",
    "name": "Alejandro Blanco",
    "role": "Ingeniero de Automatización QA",
    "email_label": "EMAIL",
    "email": "alejandroblancosanchez0@gmail.com",
    "phone_label": "PHONE",
    "phone": "+57 314 2631327",
    "location_label": "Ubicación",
    "location": "Colombia, Bogota",
    "nav_about": "Sobre mí",
    "nav_resume": "Hoja de vida",
    "nav_portfolio": "Portafolio",
    "about_title": "Sobre mí",
    "about_paragraph_1": "Ingeniero de Automatización QA con más de 5 años de experiencia mejorando la calidad y el rendimiento del software en entornos web, móviles y datáfonos. Especialista en frameworks escalables con Java, Serenity BDD, Screenplay, Rest-Assured y K6.",
    "about_paragraph_2": "Certificado en AWS Cloud Practitioner, he liderado y contribuido a iniciativas clave como el proyecto de corresponsales bancarios para uno de los grupos financieros más grandes de Latinoamérica, asegurando automatización y trazabilidad a escala. Trabajo en integración CI/CD, adopción BDD y pruebas de rendimiento.",
    "about_paragraph_3": "Enfocado en resultados, autocrítico y comprometido con aportar claridad mediante la automatización. Me adapto bien a equipos ágiles, documento con precisión y cuestiono supuestos para prevenir errores. Si buscas alguien que automatice con propósito y piense en sistemas: conversemos.",
    "focus_title": "Mi enfoque",
    "focus_mobile": "Automatización Móvil",
    "focus_mobile_desc": "Automatización end-to-end en Android usando Appium. Validaciones diseñadas para dispositivos reales y datáfonos.",
    "focus_web": "Automatización Web",
    "focus_web_desc": "Automatización de UI con Java, Selenium y Serenity BDD. Patrón Screenplay para mantenibilidad, pasos reutilizables e integración Gherkin.",
    "focus_api": "Automatización de APIs",
    "focus_api_desc": "Validación con Rest-Assured. Modelos de datos dinámicos, validando endpoints con payloads personalizados y objetos reutilizables.",
    "focus_k6": "Pruebas de Carga con K6",
    "focus_k6_desc": "Pruebas de carga con K6 usando Grafana y validación en base de datos para medir latencia, TPS, tasas de error y verificar los NRF.",
    "resume_title": "Hoja de vida",
    "experience_section": "EXPERIENCIA",
    "education_section": "EDUCACIÓN",
    "role_wompi": "Desarrollador QA",
    "role_assertsoft": "Analista QA y Tester",
    "role_serviex": "Analista QA",
    "role_hitss": "Practicante QA",
    "education_1": "Ingeniería de Sistemas",
    "education_2": "Tecnología en Análisis y Diseño de Sistemas",
    "education_3": "Técnico en Operación y Mantenimiento de Bases de Datos",
    "status_completed": "Finalizado",
    "institution": "Fundación Universitaria Compensar",
    "portfolio_title": "Portafolio Web",
    "project_1_desc": "Un proyecto que hice para mejorar mis habilidades de inglés y desarrollo usando Firebase, JavaScript y CSS. Pero lo más importante fue explorar cómo trabajar con la API de ChatGPT generando cualquier pregunta con el prompt exacto.",
    "project_2_desc": "Un proyecto que creé para ayudar a otros a aprender sobre automatización QA. Incluye recursos, tutoriales y guías sobre Selenium, Rest-Assured, pruebas de rendimiento y material ISTQB. El objetivo es ofrecer una plataforma de aprendizaje completa para futuros QA.",
    "status_finalized": "Finalizado"
  }
}